{
    "sectionName": {
        "1": "start",
        "2": "o mnie",
        "3": "Projety"
    },
    "start": {
        "title_1": "Hej, Jestem Maciej Kuboń",
        "title_2": "Frontend developer",
        "description" : "Student informatyki stosowanej na Politechnice Krakowskiej, członek koła naukowego Programistów i Miłośników Informatyki Politechniki Krakowskiej.”",
        "readMore": "Zobacz więcej"
    },
    "about": {
        "description": "Obecnie jestem studentem Informatyki Stosowanej na Politechnice Krakowskiej. Ukoczyłem Technikum nr 1 im. Ignacego Mościckiego w Tarnowie z dyplomem technik informatyk. Od lat szkolnych pasjonuje się informatyką. W październiku 2022 roku wstąpiłem do Koła Programistów i Miłośników Informatyki, gdzie współtowrzyem stronę internetową koła oraz brałem udział w projekcie AquaSharp. Obecnie pracujemy nad aplikacją będącą komunikatorem Obecnie pracujemy nad aplikacją będącą komunikatorem o nazwie PIMIConnect . Od lipca 2023 do września 2023 pracowałem w firmie Selkea na stanowisku serwisant sprzętu komputerowego.",
        "skills" : "umiejętności ",
        "language" : "języki",
        "links" : "linki",
        "languageName": {
            "polish" : "polski",
            "english" : "angielski"
        }
    },
    "projects":{
        "gallery" : "galeria",
        "description" : "opis",
        "technology": "Technologie",
        "selectProject": "Wybierz Projekt",
        "projectDescription":{
            "1":  "Strona internetowa, która powstała na potrzeby koła naukowego Programistów i Miłośników Informatyki działającego przy Wydziale Mechanicznym Politechniki Krakowskiej. Została ona wykonana jako jeden z pierwszych projektów po rekatywacji koła. W towrzeniu strony brało udział kilku członków koła naukowego. ",
            "2" : "Strona powstała jako projekt akademicki. Został wykonanych według jasno okreśonych wytycznych. Strona ma prezentować wygląd oraz działanie od strony Front-end platformy do rezerwacji wizyt u lekarza. Pozwala ona na wybór specjalności lekarzy a następnie konkretnego lekarza. Następnie wybieramy cel wizyty oraz dzień wraz z godziną. możemy również anulować wizyte.",
            "3" : "Projekt wykonany podczas nauki języka TypeScript. W ramach nauki przepisałem jeden z poprzednich proejktów z JavaScript/JQuery na TypeScript. Wszystkie funkcjonalności pozostały bez zmian. Takie jak: wybór specjalności lekarzy a następnie konkretnego lekarza, wybranie celu wizyty oraz dzień wraz z godziną.",
            "4" : "Projekt powstał w celu zaprezentowania siebie wraz z moimi obecnymi projektami i osiągnięciami. Podczas programowania korzystałem z frameworku Angular i TypeScript. Strona została zaprojektowana tak, aby była w pełni responsywna. "
        }
    }
}